src/cf/DataProcessors/ПроверкаИНН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаИНН</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегионаПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегионСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РайонСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаселенныйПунктСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УлицаСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКладр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИАСДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИАСГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИАСРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИАСУлицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИАСРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИАСНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ПроверкаИНН/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="ДанныеКонтрагентаПоИНН" Тогда
		стрВариант="РеквизитыЮрЛицаПоИНН";
		Если Не ВладелецФормы=Неопределено Тогда
			стрВариант="РеквизитыПредпринимателяПоИНН";
			Если ВладелецФормы.Объект.ЮрФизЛицо=ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
				стрВариант=?(ВариантПоиска="ИНН", "РеквизитыЮрЛицаПоИНН", "РеквизитыЮрЛицПоНаименованию");
			КонецЕсли;
		КонецЕсли;
		ВыполнитьПоиск(стрВариант);
		
	ИначеЕсли Команда.Имя="ЗаполнитьДанныеКонтрагента" Тогда
		Если Не ВладелецФормы=Неопределено Тогда
			ВладелецФормы.Объект.КПП=ЗначениеРеквизитаКонтрагента("КПП");
			ВладелецФормы.Объект.Наименование=ЗначениеРеквизитаКонтрагента("Наименование");
			ВладелецФормы.Объект.НаименованиеПолное=ЗначениеРеквизитаКонтрагента("НаименованиеСокращенное");
			ВладелецФормы.Объект.ЕГРН=ЗначениеРеквизитаКонтрагента("РегистрационныйНомер");

			//Контактная информация (Юридический адрес)
			ЮридическийАдрес=тпДанные_НайтиЗначение("ЮридическийАдрес");
			Если ЗначениеЗаполнено(ЮридическийАдрес) Тогда
				ЗаписатьКонтактнуюИнформацию(ЮридическийАдрес, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"));
			КонецЕсли;
			// Заполнение телефона
			Телефон=тпДанные_НайтиЗначение("Телефон");
			Если ЗначениеЗаполнено(Телефон) Тогда
				ЗаписатьКонтактнуюИнформацию(Телефон, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента"));
			КонецЕсли; 
			// Заполнение контактного лица
			//***ДополнительныеСвойства.Вставить("КонтактноеЛицоКонтрагента", РК.Руководитель);
		КонецЕсли; 
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоиск(стрВариант)
	Если стрВариант="РеквизитыЮрЛицаПоИНН" Тогда
		Реквизиты=Обработки.ПроверкаИНН.РеквизитыЮрЛицаПоИНН(СокрЛП(Объект.ИНН));

	ИначеЕсли стрВариант="РеквизитыПредпринимателяПоИНН" Тогда
		Реквизиты=Обработки.ПроверкаИНН.РеквизитыПредпринимателяПоИНН(СокрЛП(Объект.ИНН));
		
	ИначеЕсли стрВариант="РеквизитыЮрЛицПоНаименованию" Тогда
		Реквизиты=Обработки.ПроверкаИНН.РеквизитыЮрЛицПоНаименованию(СокрЛП(Объект.ИНН), СокрЛП(Объект.КодРегионаПоиска), СокрЛП(Объект.АдресПоиска));
	КонецЕсли;
	Если НЕ ТипЗнч(Реквизиты)=Тип("Структура") Тогда Возврат; КонецЕсли;

	дзБуфер=РеквизитФормыВЗначение("дзДанные");
	дзБуфер.Строки.Очистить();
	Если Реквизиты.Свойство("КоличествоНайденных") Тогда
		Для каждого СтрокаКоллекции Из Реквизиты.РеквизитыЮрЛиц Цикл
			НоваяСтрока=дзБуфер.Строки.Добавить();
			НоваяСтрока.Представление=СтрокаКоллекции.Наименование;
			дзДанные_ЗаполнитьВетку(НоваяСтрока, СтрокаКоллекции);
		КонецЦикла; 
		ДоступностьКнопки=Ложь;
	Иначе
		дзДанные_ЗаполнитьВетку(дзБуфер, Реквизиты);
		ДоступностьКнопки=Истина;
	КонецЕсли; 
	ЗначениеВРеквизитФормы(дзБуфер, "дзДанные");
	
	Элементы.дзДанныеЗаполнитьДанныеКонтрагента.Доступность=ДоступностьКнопки;
КонецПроцедуры	 

&НаСервере
Процедура ЗаписатьКонтактнуюИнформацию(Значение, Тип, Вид)
	Если Объект.Контрагент.Пустая() Тогда Возврат; КонецЕсли;
	//МенеджерЗаписи=РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.Объект=Объект.Контрагент;
	//МенеджерЗаписи.Тип=Тип;
	//МенеджерЗаписи.Вид=Вид;
	//МенеджерЗаписи.Прочитать();
	//Если НЕ МенеджерЗаписи.Выбран() Тогда
	//	МенеджерЗаписи.Объект=Объект.Контрагент;
	//	МенеджерЗаписи.Тип=Тип;
	//	МенеджерЗаписи.Вид=Вид;		
	//КонецЕсли;
	//МенеджерЗаписи.Представление=Значение;
	//МенеджерЗаписи.Записать();

	НаборЗаписей=РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект.Контрагент);
	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Прочитать();

	Обработки.ПроверкаИНН.ЗаполнитьЭлементКонтактнойИнформации(НаборЗаписей, Значение, Вид);
	
	//МенеджерЗаписи.Тип=Тип;
	//МенеджерЗаписи.Вид=Вид;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВариантПоиска_ПриИзменении(Элемент)
	Элементы.ИНН.Видимость=ВариантПоиска="ИНН";
	Элементы.КодРегионаПоиска.Видимость=НЕ ВариантПоиска="ИНН";
	Элементы.АдресПоиска.Видимость=НЕ ВариантПоиска="ИНН";
	Элементы.ДанныеКонтрагентаПоИНН.Заголовок="Найти данные контрагента по "+?(ВариантПоиска="ИНН", "ИНН", "коду региона\адресу");
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличной части "Данные"

&НаСервере
Функция ЗначениеРеквизитаКонтрагента(Идентификатор)
	дзБуфер=РеквизитФормыВЗначение("дзДанные");
	РезультатПоиска=дзБуфер.Строки.Найти(Идентификатор, "Идентификатор", Истина);
	Возврат ?(РезультатПоиска=Неопределено, Неопределено, РезультатПоиска.Значение); 
КонецФункции

&НаСервере
Функция тпДанные_НайтиЗначение(Идентификатор)
	дзБуфер=РеквизитФормыВЗначение("дзДанные");
	РезультатПоиска=дзБуфер.Строки.Найти(Идентификатор, "Идентификатор", Истина);
	Возврат ?(РезультатПоиска=Неопределено, "", ?(ТипЗнч(РезультатПоиска.Данные)=Тип("Структура"), РезультатПоиска.Данные, РезультатПоиска.Значение)); 
КонецФункции

&НаСервере
Процедура дзДанные_ЗаполнитьВетку(Ветка, Реквизиты)
	Соответсвия=Новый Структура;
	Соответсвия.Вставить("ИНН", "ИНН");
	Соответсвия.Вставить("КПП", "КПП");
	Соответсвия.Вставить("Наименование", "Наименование");
	Соответсвия.Вставить("НаименованиеПолное", "Наименование полное");
	Соответсвия.Вставить("НаименованиеСокращенное", "Наименование сокращенное");
	Соответсвия.Вставить("РегистрационныйНомер", "Регистрационный номер");
	Соответсвия.Вставить("ПравоваяФорма", "Правовая форма");
	Соответсвия.Вставить("ЮридическийАдрес", "Юридический адрес");
	Соответсвия.Вставить("РегистрацияВНалоговомОргане", "Регистрация в налоговом органе");
	Соответсвия.Вставить("ДатаРегистрации", "Дата регистрации");
	Соответсвия.Вставить("РегистрацияВПенсионномФонде", "Регистрация в пенсионном фонде");
	Соответсвия.Вставить("РегистрационныйНомерПФР", "Регистрационный номер");
	Соответсвия.Вставить("КодОрганаПФР", "Код органа");
	Соответсвия.Вставить("НаименованиеОрганаПФР", "Наименование органа");
	Соответсвия.Вставить("РегистрацияВФСС", "Регистрация");
	Соответсвия.Вставить("РегистрационныйНомерФСС", "Регистрационный номер");
	Соответсвия.Вставить("КодПодчиненности", "Код подчиненности");
	Соответсвия.Вставить("КодОрганаФСС", "Код органа");
	Соответсвия.Вставить("НаименованиеОрганаФСС", "Наименование органа");
	Соответсвия.Вставить("КодОКВЭД", "Код ОКВЭД");
	Соответсвия.Вставить("ОписаниеОшибки", "Описание ошибки");

	Для каждого СтрокаКоллекции1 Из Реквизиты Цикл
		СтрокаДерева=Ветка.Строки.Добавить();
		СтрокаДерева.Идентификатор=СтрокаКоллекции1.Ключ;
		Попытка СтрокаДерева.Представление=Соответсвия[СтрокаКоллекции1.Ключ];
		Исключение СтрокаДерева.Представление=СтрокаДерева.Идентификатор;
		КонецПопытки;
		СтрокаДерева.Значение=СтрокаКоллекции1.Значение;
		СтрокаДерева.Данные=СтрокаКоллекции1.Значение; //***
		Если ТипЗнч(СтрокаКоллекции1.Значение)=Тип("Структура") Тогда
			Для каждого СтрокаКоллекции2 Из СтрокаКоллекции1.Значение Цикл
				НоваяСтрока=СтрокаДерева.Строки.Добавить();
				НоваяСтрока.Идентификатор=СтрокаКоллекции2.Ключ;
				Попытка НоваяСтрока.Представление=Соответсвия[СтрокаКоллекции2.Ключ];
				Исключение НоваяСтрока.Представление=НоваяСтрока.Идентификатор;
				КонецПопытки; 
				
				НоваяСтрока.Значение=СтрокаКоллекции2.Значение;
				НоваяСтрока.Данные=СтрокаКоллекции2.Значение; //***
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантПоиска="ИНН";
	Если Не ВладелецФормы=Неопределено Тогда
		Объект.ИНН=ВладелецФормы.Объект.ИНН;
		Объект.Контрагент=ВладелецФормы.Объект.Ссылка;
	КонецЕсли;
КонецПроцедуры
